## Numpy

This is just another thhird party library that we can use in python... We are not going to use this library too much....
But it is at the heart of Pandas.

This library defines a new datatype... which is called:  `numpy.NaN`
NaN: Not a Number

In [36]:
import pandas as pd
import numpy as np

people = {
    "Surname" : ( "Ivan" , "Francisca", "Francisco", "Helena", "Juliana" ),
    "Age":      ( 43, np.NaN , 29, 30, 27 )
}

people_dataframe = pd.DataFrame( people )
people_dataframe

     Surname   Age
0       Ivan  43.0
1  Francisca   NaN
2  Francisco  29.0
3     Helena  30.0
4    Juliana  27.0

# Missing values

In [2]:
people_dataframe['Age']

0    43.0
1     NaN
2    29.0
3    30.0
4    27.0
Name: Age, dtype: float64

In [3]:
people_dataframe['Age'].isna()

0    False
1     True
2    False
3    False
4    False
Name: Age, dtype: bool

In [4]:
people_dataframe[  people_dataframe['Age'].isna()  ]

     Surname  Age
1  Francisca  NaN

In [5]:
people_dataframe[  people_dataframe['Age'].isna()==False ]

     Surname   Age
0       Ivan  43.0
2  Francisco  29.0
3     Helena  30.0
4    Juliana  27.0

In [6]:
people_dataframe['Age'].fillna(-1)

0    43.0
1    -1.0
2    29.0
3    30.0
4    27.0
Name: Age, dtype: float64

In [7]:
people_dataframe['Age'].replace(np.NaN, -1)

0    43.0
1    -1.0
2    29.0
3    30.0
4    27.0
Name: Age, dtype: float64

In [8]:
people_dataframe.dropna()

     Surname   Age
0       Ivan  43.0
2  Francisco  29.0
3     Helena  30.0
4    Juliana  27.0

In [12]:
#def replaceNaNAges(age):
    # If the value is NaN then I want the value to be -1
#    if np.isnan(age) :
#        return -1
#    return age

## We cannot type more than 1 line of code within a lambda expression
# We can use the inline if syntax:
# -1 if np.isnan(age) else age

people_dataframe['Age'].apply( lambda age: -1 if np.isnan(age) else age )
#people_dataframe['Age'].fillna(-1)
#people_dataframe['Age'].replace(np.NaN, -1)

0    43.0
1    -1.0
2    29.0
3    30.0
4    27.0
Name: Age, dtype: float64

In [13]:
# Basic statistics functions
people_dataframe

     Surname   Age
0       Ivan  43.0
1  Francisca   NaN
2  Francisco  29.0
3     Helena  30.0
4    Juliana  27.0

In [16]:
people_dataframe['Cumsum']=people_dataframe['Age'].cumsum()

In [17]:
people_dataframe

     Surname   Age  Cumsum
0       Ivan  43.0    43.0
1  Francisca   NaN     NaN
2  Francisco  29.0    72.0
3     Helena  30.0   102.0
4    Juliana  27.0   129.0

In [18]:

people = {
    "Surname" : ( "Ivan" , "Francisca", "Francisco", "Helena", "Juliana" ),
    "Age":      ( 43, np.NaN , 29, 30, 29 )
}

people_dataframe = pd.DataFrame( people )
people_dataframe

     Surname   Age
0       Ivan  43.0
1  Francisca   NaN
2  Francisco  29.0
3     Helena  30.0
4    Juliana  29.0

In [19]:
people_dataframe['Age'].unique()

array([43., nan, 29., 30.])

In [20]:
people_dataframe['Age'].value_counts() # Table of frequencies

29.0    2
43.0    1
30.0    1
Name: Age, dtype: int64

In [21]:
people_dataframe['Age'].mean()

32.75

In [23]:
people_dataframe['Age'].max()
people_dataframe['Age'].min()
people_dataframe['Age'].median()
people_dataframe['Age'].std()

6.849574196011505

In [24]:
people_dataframe['Age'].mean()-people_dataframe['Age'].std()

25.900425803988494

In [25]:
people_dataframe['Age'].mean()+people_dataframe['Age'].std()

39.5995741960115

In [26]:
people_dataframe

     Surname   Age
0       Ivan  43.0
1  Francisca   NaN
2  Francisco  29.0
3     Helena  30.0
4    Juliana  29.0

In [31]:
group_people= people_dataframe.groupby('Age') # GROUP BY in SQL

In [32]:
group_people.size()

Age
29.0    2
30.0    1
43.0    1
dtype: int64

In [34]:
group_people.describe()

     Surname
       count unique        top freq
Age
29.0       2      2  Francisco    1
30.0       1      1     Helena    1
43.0       1      1       Ivan    1